Repository: Abdallah-Allaham/Nabd-OSC
Catalog: lib/l10n/app_*.arb
Languages: ar

# appTitle
source: Noor
ar: نور

# appName
source: Making Noor A Reality
ar: Noor

# welcomeMessage
source: Welcome to Noor app
ar: مرحباً بك في تطبيق نور

source: Alert
ar: تنبيه

# permissionsMessage
source: To continue working efficiently in the background, we need these permissions. Please grant us permissions to ignore battery optimizations, appear on top of other apps, and accessibility.
ar: لاستمرار عمل التطبيق في الخلفية بكفاءة، نحتاج إلى هذه الأذونات. يرجى منحنا صلاحيات تجاهل استهلاك البطارية، والظهور فوق التطبيقات الأخرى، وإمكانية الوصول.

source: Grant Permissions
ar: منح الأذونات

source: Ignore
ar: تجاهل

# loginTitle
source: Login
ar: تسجيل الدخول

# enterPhoneNumberManually
source: Or enter your phone number manually
ar: أو أدخل رقم الهاتف يدوياً

source: Verify
ar: تحقق

# createAccount
source: Create New Account
ar: إنشاء حساب جديد

# invalidPhoneNumber
source: Invalid Jordanian phone number
ar: رقم هاتف أردني غير صحيح

# phoneNumberEntered
source: The number has been entered: {phoneNumber}
ar: تم إدخال الرقم: {phoneNumber}

# otpVerificationTitle
source: OTP Verification
ar: تحقق من الرمز السري

# otpMessage
source: We have sent a verification code to your phone number.
ar: لقد أرسلنا رمز التحقق إلى رقم هاتفك.

# smsPermissionMessage
source: Please allow us to read messages to enable auto-fill.
ar: الرجاء السماح بقراءة الرسائل لتفعيل الملء التلقائي.

# codeEntered
source: The code has been entered: {otpCode}
ar: تم إدخال الرمز: {otpCode}

# pageHome
source: Home
ar: الرئيسية

# pagePDFReader
source: PDF Reader
ar: القارئ

# pageHistory
source: History
ar: السجل

# pageConnectivity
source: Connectivity
ar: الاتصال

# pageSettings
source: Settings
ar: الإعدادات

# pageProfile
source: Profile
ar: الملف الشخصي

# pageOpened
source: You are now on the {pageTitle} page
ar: أنت الآن في صفحة {pageTitle}

# profileOpened
source: Profile page opened
ar: تم فتح صفحة الملف الشخصي

# microphoneOn
source: Microphone is on...
ar: المايك يعمل...

# microphoneOffSessionEnded
source: Microphone is off (session ended)
ar: تم إيقاف المايك (انتهاء الجلسة)

# microphoneOffSilence
source: Microphone is off due to silence
ar: تم إيقاف المايك بسبب الصمت

source: Enter your name
ar: أدخل اسمك

# enterNameManually
source: Or enter your name manually
ar: أو أدخل اسمك يدوياً

source: Next
ar: التالي

source: Sign Up
ar: تسجيل

# nameEntered
source: Name entered: {name}
ar: تم إدخال الاسم: {name}

# phoneVerified
source: Phone number verified successfully
ar: تم التحقق من رقم الهاتف بنجاح.

# recordYourVoice
source: Record your voiceprint
ar: سجل بصمة صوتك

# voiceEnrollmentMessage
source: Press the button below and speak for 7 seconds to record your voiceprint.
ar: اضغط على الزر أدناه وتحدث لمدة 7 ثوانٍ لتسجيل بصمتك الصوتية.

source: Start Recording
ar: ابدأ التسجيل

# completingSignup
source: Completing the registration process...
ar: جاري إتمام عملية التسجيل...

# signupError
source: Registration error: {errorMessage}
ar: خطأ في التسجيل: {errorMessage}

# loginPageSemantics
source: Login page, enter your phone number by speaking or typing.
ar: صفحة تسجيل الدخول، أدخل رقم هاتفك عن طريق الكلام أو الكتابة.

# otpScreenSemantics
source: OTP verification screen, enter the verification code by speaking or typing.
ar: صفحة التحقق من الرمز السري، أدخل رمز التحقق عن طريق الكلام أو الكتابة.

source: Home
ar: الرئيسية

source: History
ar: السجل

# setting
source: Settings
ar: الاعدادات

source: Profile
ar: الملف الشخصي

source: PDF Reader
ar: Pdf قارئ

# switch_language
source: Language
ar: اللغة

source: Logout
ar: تسجيل خروج

source: Connectivity
ar: الاتصال

source: Account Info
ar: معلومات الحساب

source: Name
ar: الاسم

source: Phone
ar: رقم الهاتف

source: Edit
ar: تعديل

source: Save
ar: حفظ

source: Cancel
ar: إلغاء

# new_value
source: Enter new {field}
ar: أدخل {field} الجديد

source: Camera
ar: كاميرا

# cameraOpened
source: Camera is open
ar: الكاميرا مفتوحة

# cameraClosed
source: Camera is closed
ar: الكاميرا مغلقة

# cameraInitializing
source: Initializing Camera...
ar: جاري تشغيل الكاميرا...

source: Camera Permission Required
ar: إذن الكاميرا مطلوب

# cameraPermissionMessage
source: This app needs camera permission to take photos.
ar: هذا التطبيق يحتاج إذن الكاميرا لالتقاط الصور.

# cameraError
source: Error
ar: خطأ

source: Photo captured successfully!
ar: تم التقاط الصورة بنجاح!

source: Failed to capture photo
ar: فشل في التقاط الصورة

source: Failed to initialize camera
ar: فشل في تشغيل الكاميرا

source: Retake
ar: إعادة التقاط

source: Settings
ar: الإعدادات

# wifiQrTitle
source: WiFi QR Code
ar: رمز QR للواي فاي

source: Network Name
ar: اسم الشبكة

source: Password
ar: كلمة المرور

source: User ID
ar: معرف المستخدم

# qrInstructions
source: Scan this QR code with another device to connect to the WiFi network
ar: امسح هذا الرمز بجهاز آخر للاتصال بشبكة الواي فاي

source: Close
ar: إغلاق

source: Capturing
ar: جاري التقاط

# qrVisible
source: QR code detected
ar: تم اكتشاف رمز QR

# wifiShare
source: Share WiFi
ar: مشاركة الواي فاي

# generateQr
source: Generate QR Code
ar: إنشاء رمز QR

source: Opening Wi-Fi settings
ar: فتح إعدادات الواي فاي

source: Code ready
ar: الكود جاهز

# fallback_use_system_qr
source: Use system QR
ar: استخدم رمز النظام

source: Confirm identity
ar: تأكيد الهوية

source: Operation Successful
ar: تمت العملية بنجاح

# wifi_settings_opened
source: Wi-Fi settings have been opened. The system will automatically navigate to your connected network and show the QR code.
ar: تم فتح إعدادات الواي فاي. سيقوم النظام بالانتقال تلقائياً إلى الشبكة المتصلة وعرض رمز QR.

# guidance_move_down_right
source: Move phone down-right
ar: حرّك الهاتف للأسفل واليمين

# guidance_move_down_left
source: Move phone down-left
ar: حرّك الهاتف للأسفل واليسار

# guidance_move_up_right
source: Move phone up-right
ar: حرّك الهاتف للأعلى واليمين

# guidance_move_up_left
source: Move phone up-left
ar: حرّك الهاتف للأعلى واليسار

# guidance_move_away
source: Move slightly away from the paper
ar: ابتعد قليلًا عن الورقة

# guidance_perfect
source: Perfect framing
ar: إطار مثالي

# guidance_no_document
source: No document detected
ar: لم يتم العثور على مستند

# guidance_unknown
source: Unknown guidance
ar: توجيه غير معروف

# guidance_raise_phone
source: Raise the phone slightly
ar: ارفع الهاتف قليلًا

# guidance_away_and_raise
source: Move slightly away and raise the phone slightly
ar: ابتعد قليلًا وارفع الهاتف قليلًا

# guidance_connected
source: Connected
ar: متصل

# guidance_disconnected
source: Disconnected
ar: غير متصل
